import fs from 'fs-extra';

export default {
    name: "البنك",
    aliases: ["بنك"],
    category: "economy",

    async run({ sock, m }) {
        const chatId = m.key.remoteJid;
        
        await sock.sendMessage(chatId, { react: { text: "🏦", key: m.key } });

        const bankInfoTemplate = `
*⎔┄┄─ ⊱╎⌯ 𝐒 𝐎 𝐋 𝐎 ⌯╎⊰─┄┄⎔*

*★┇ مـركـز الـنـظـام الإقـتـصـادي ┇★*

*⎔┄┄─── ⊱╎⌯ 🌑 ⌯╎⊰ ───┄┄⎔*

*❑ أولاً : نـظـام الـبـنـك 💰↯*

*──────────────────────*

*💬 | الـتـفـاعـل : كـل رسـالـة تـرسـلـهـا تـمـنـحـك (1 عـمـلـة) تـضـاف لـخـزنتـك تـلـقـائـيـاً.*

*🎁 | الـراتـب : يـمـكـنـك الـمـطـالـبـة بـࢪاتـب كـل 24 سـاعـة عـبـر الأمـر (.راتب).*

*📉 | الـتـرقـيـة : رصـيـدك هـو مـقـيـاس قـوتـك، كـلـمـا زاد مـالـك، زادت ࢪتـبـتـك.*

*⎔┄┄─── ⊱╎⌯ 🌑 ⌯╎⊰ ───┄┄⎔*

*❑ ثـانـيـاً : أوامـࢪ الـبـنـك 🕹️↯*

*──────────────────────*
*⦓ .رصيدي ⦔ : لـمـعـرفـة ثـروتـك الـحـالـيـة و رتـبـتـك.*

*⦓ .رصيد ⦔ : لـمـعـࢪفـة ࢪصـيـد عـضـواً ما [هـذا الأمـࢪ عـلـيـه ضـࢪيـبـة 20 عـمـلـة ثـمـن الاسـتـعـلام]*

*⦓ .راتب ⦔   : لـتـلـقـي ࢪاتـب يـومـي حـسـب ࢪتـبـتـك.*

*⦓ .تحويل ⦔  : لـتـحـويـل الأمـوال بـيـن الاعـضـاء.*

*⦓ .رهان ⦔   : لـلـتـحـدي و مـضـاعـفـة الـمـكـسـب, اذا راهـنـت بـ مبـلـغ و فـزت تـاخـذ ضـعـف الـمـبـلـغ الـذي ࢪاهـنـت به و اذا خـسـرت تـخـسـر الـمـبـلـغ الـذي ࢪاهـنـت به [نـسـبـة الـفـوز 50%].*

*⦓ .سطو ⦔ : هـذا الامـࢪ يـنـفـذ عـمـلـيـة سـرقـة بـنـك نـسـبـة نـجـاحـهـا 40%, اذا نـجـحـت الـعـمـلـيـة تـفـوز بـ زيـادة 10% عـلـى حـسـب عـدد أمـوالـك، و اذا فـشـلـت الـعـمـليـة تـخـسـر بـ خـصـم 5%.*

*⦓ .سرقة ⦔ بـهـذا الأمـر يـمـكـنـك سـࢪقـة الأعـضـاء و نـسـبـة نـجـاحه 70% و اذا نـجـحـت عـمـلـيـة الـسـࢪقـة، سـتـسـࢪق مـنـه 5% مـمـا يـمـلـك و اذا فـشـلـت الـعـمـلـيـة سـتـخـسـر أنت 2% مـمـا تـمـلـك و يـأخـذهـم الـشـخـص الـذي كـنـت تـࢪيـد سـࢪقـتـه.*

*⦓ .المتجر ⦔ : يـمـكـنـك شـࢪاء الـعـديـد من الالـقـاب و الاغـࢪاض مـن الـمـتـجـࢪ.*

*⎔┄┄─── ⊱╎⌯ 🌑 ⌯╎⊰ ───┄┄⎔*

*❑ ثـالـثـاً : ࢪتـب الـبـنـك والـتـࢪقـيـة 🪙↯*

*──────────────────────*
*👑 حـاكـم الـكـوكـب : (100k عملة) ↫ ࢪاتـبـه الـيـومـي 10,000*

*💎 مـسـتـثـمـر عـالـمـي : (70k عملة) ↫ ࢪاتـبـه الـيـومـي 5000*

*💰 مـلـيـارديـر : (50k عملة) ↫ ࢪاتـبـه الـيـومـي 2500*

*💸 مـلـيـونـيـر : (30k عملة) ↫ ࢪاتـبـه الـيـومـي 1700*

*💼 رجل أعـمـال : (20k عملة) ↫ ࢪاتـبـه الـيـومـي 600*

*✨ ثـري : (10k عملة) ↫ ࢪاتـبـه الـيـومـي 300*

*🌱 عضو مكافح : (البداية) ↫ ࢪاتـبـه الـيـومـي 100*

*⎔┄┄ ⊱╎⌯ 𝐒𝐎𝐋𝐎 𝐄𝐂𝐎 ⌯╎⊰ ┄┄⎔*

*☜ قـوتـك لـيـسـت فـي كـلامـك ولا أفـعـالـك، بـل فـي حـجـم أمـوالـك💰*

*⎔┄┄── ⊱╎⌯ 🏮 ⌯╎⊰ ──┄┄⎔*`.trim();

        return await sock.sendMessage(chatId, { text: bankInfoTemplate }, { quoted: m });
    }
};